In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"description":["Data Science is “A multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data”"]})

In [3]:
df1

                                         description
0  Data Science is “A multi-disciplinary field th...

In [4]:
pd.set_option('display.max_colwidth', 1000)

In [5]:
df1

                                                                                                                                                                            description
0  Data Science is “A multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data”

In [6]:
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)

In [7]:
df1

                                                                                                                                                                            description
0  Data Science is “A multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data”

In [8]:
df1["char_len"] = df1['description'].apply(len)

In [9]:
df1

,description,char_len
0,"Data Science is “A multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data”",180

In [10]:
a = "I am Vikash"
len(a)

11

In [11]:
len(a.split())

3

In [12]:
df1["word_count"] = df1["description"].apply(lambda x: len(x.split()))

In [13]:
df1

,description,char_len,word_count
0,"Data Science is “A multi-disciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from structured and unstructured data”",180,24

In [15]:
data = {'text':['Hello data science', 'I love ML', 'I read ml books']}
a = pd.DataFrame(data)

In [16]:
a

                 text
0  Hello data science
1           I love ML
2     I read ml books

In [17]:
a['text_lower'] = a['text'].str.lower()

In [18]:
a

                 text          text_lower
0  Hello data science  hello data science
1           I love ML           i love ml
2     I read ml books     i read ml books

In [19]:
a['text_upper'] = a['text'].str.upper()
a

                 text          text_lower          text_upper
0  Hello data science  hello data science  HELLO DATA SCIENCE
1           I love ML           i love ml           I LOVE ML
2     I read ml books     i read ml books     I READ ML BOOKS

In [20]:
a['text'][0].startswith('H')

True

In [21]:
a['text'][1].startswith('H')

False

In [23]:
a['text'][0].startswith('H')

True

In [22]:
df1 = pd.DataFrame({'a':[1,2,4,5,6],
                      'b':[4,5,6,7,8],
})
df1

   a  b
0  1  4
1  2  5
2  4  6
3  5  7
4  6  8

In [24]:
df1['mul_a'] = df1['a'] * 5

In [25]:
df1

   a  b  mul_a
0  1  4      5
1  2  5     10
2  4  6     20
3  5  7     25
4  6  8     30

In [27]:
df1.a.mean()

np.float64(3.6)

In [28]:
df1.a.median()

np.float64(4.0)

In [29]:
df1.a.mode()

0    1
1    2
2    4
3    5
4    6
Name: a, dtype: int64

In [30]:
df1.a.min()

np.int64(1)

In [31]:
df1.a.max()

np.int64(6)

In [32]:

df1.a.sum()

np.int64(18)

In [33]:
df1.a.var()

np.float64(4.3)

In [34]:
df1.a.describe()

count    5.000000
mean     3.600000
std      2.073644
min      1.000000
25%      2.000000
50%      4.000000
75%      5.000000
max      6.000000
Name: a, dtype: float64

In [35]:
df2 = pd.DataFrame({"a": [1, 2, 3, 4, 5, 6, 7, 8, 9]})
df2

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [36]:
df2.a.mean()

np.float64(5.0)

In [37]:
df2

   a
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [38]:
df2.rolling(window = 1).mean()

     a
0  1.0
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [39]:
df2.rolling(window = 2).mean()

     a
0  NaN
1  1.5
2  2.5
3  3.5
4  4.5
5  5.5
6  6.5
7  7.5
8  8.5

In [41]:
df3 = df2.rolling(window = 3).mean()
df3

     a
0  NaN
1  NaN
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [43]:
df3.dropna(inplace=True)
df3

     a
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [44]:
#Typecasting
df3['a_int'] = df3['a'].astype(int)

In [45]:
df3

     a  a_int
2  2.0      2
3  3.0      3
4  4.0      4
5  5.0      5
6  6.0      6
7  7.0      7
8  8.0      8

In [46]:
df2.rolling(window = 2).sum()

      a
0   NaN
1   3.0
2   5.0
3   7.0
4   9.0
5  11.0
6  13.0
7  15.0
8  17.0

In [47]:
df2.rolling(window = 2).min()

     a
0  NaN
1  1.0
2  2.0
3  3.0
4  4.0
5  5.0
6  6.0
7  7.0
8  8.0

In [48]:
df2.rolling(window = 2).max()

     a
0  NaN
1  2.0
2  3.0
3  4.0
4  5.0
5  6.0
6  7.0
7  8.0
8  9.0

In [49]:
import numpy as np
np.random.choice(['A', 'B'])

np.str_('A')

In [50]:
df2['Group'] = np.random.choice(['A', 'B'], size = 9)

In [51]:
df2

   a Group
0  1     A
1  2     A
2  3     A
3  4     A
4  5     A
5  6     B
6  7     B
7  8     A
8  9     A

In [53]:
#groupby with rolling sum
df2.groupby('Group')['a'].sum()

Group
A    32
B    13
Name: a, dtype: int64

In [52]:
#groupby with rolling sum
df2.groupby('Group')['a'].rolling(window = 2).sum()

Group
A      0     NaN
       1     3.0
       2     5.0
       3     7.0
       4     9.0
       7    13.0
       8    17.0
B      5     NaN
       6    13.0
Name: a, dtype: float64